app/views/users/show.html.erb

<ul>
<% current_user.cats.each do |cat| %>
---
SELECT "cats".* FROM "cats" WHERE "cats"."user_id" = $1  [["user_id", 1]]

  </tr>
  <% current_user.cat_rental_requests.each do |req| %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."user_id" = $1  [["user_id", 1]]