app/controllers/cat_rental_requests_controller.rb

  def create
    # @rental_request = current_user.cat_rental_requests.new(cat_rental_request_params)
    full_params = cat_rental_request_params
    full_params[:user_id] = current_user.id
    # fail
    @rental_request = CatRentalRequest.new(full_params)
    # @rental_request = CatRentalRequest.new(cat_rental_request_params)
    if @rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "end_date", "start_date", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 4], ["end_date", "2017-03-23"], ["start_date", "2017-03-08"], ["status", "PENDING"], ["created_at", "2017-03-22 21:04:48.726702"], ["updated_at", "2017-03-22 21:04:48.726702"]]