app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "description", "name", "sex", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    # @cat = Cat.new(cat_params)
    @cat = current_user.cats.new(cat_params)
    if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "cats" SET "image_file_name" = $1, "image_file_size" = $2, "image_updated_at" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["image_file_name", "kitty6.jpg"], ["image_file_size", 54277], ["image_updated_at", "2017-03-23 02:56:48.420209"], ["updated_at", "2017-03-23 02:56:48.442490"], ["id", 7]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(cat_params)