app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "email", "password_digest", "session_token") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_name", "zward"], ["email", "zach.l.ward6@gmail.com"], ["password_digest", "$2a$10$PdET0ydme3htrylQb6ETHefQEb4V0bCq4bosSAxy91JGI7ZirHlB2"], ["session_token", "lY_ktIxoHmaA-DmauZJZ1Q"]]
---
  def create
    @user = User.new(user_params)
    if @user.save